[{"_id":"64834f0a8b7fad92c5d42468","instractorname":"Shahidul Islam Faisal","instractoremail":"sifaisalcox@gmail.com","instractorimage":"https://img.freepik.com/free-photo/handsome-corporate-man-real-estate-agent-assistant-smiling-hold-hands-together-how-may-i-help-you-smiling-friendly-polite-assist-customer-white-background_176420-45257.jpg" ,"classname":"Video Presentations and Public Speaking","price":119,"description":"Are you interested in learning the necessary skills needed to make a good presentation? This online public speaking course will help you improve your public speaking skills, with a focus on video lectures. Video production can be time-consuming, difficult, technical and expensive, but in this course, you will learn skills and develop public speaking and video conferencing skills that will strengthen your career development. This video production course also covers how to create simple videos for a wide range of business communication needs.","features":[{"name":"Describe a comprehensive video production strategy for all aspects of a business"},{"name":"Analyze communications skills more effectively with clients, customers and prospective clients"},{"name":"Discuss how to connect with people around the globe through the development of public speaking skills"},{"name":"Explain how to look comfortable, confident and relaxed when speaking and presenting through verbal and body language"},{"name":"Define how to influence your audience to take the actions you want"},{"name":"Explain and create simple ‘talking head’ videos for all aspects of business"}],"seat":"30","image":"https://i.ibb.co/6WbV1F1/news-presenter-xs.jpg"},{"_id":"64835c9911ef27563c31a959","instractorname":"Shahidul Islam Faisal","instractoremail":"sifaisalcox@gmail.com", "instractorimage": "https://img.freepik.com/free-photo/handsome-corporate-man-real-estate-agent-assistant-smiling-hold-hands-together-how-may-i-help-you-smiling-friendly-polite-assist-customer-white-background_176420-45257.jpg" ,"classname":"Mastering Communication and Public Speaking Skills","price":138,"description":"This course has been divided into interactive lessons and will help you become a better orator. You will learn all the tested techniques to become more confident, relaxed and motivated to convince and win over your audience. In addition, the tutorials will guide you in engaging your colleagues using PowerPoint and ethical cheat sheets. It will also teach you to tell stories, use images and slides to enhance them and receive feedback each time you use them. As a bonus, you’ll even learn to create amazing inexpensive talking videos to impress audiences for a lifetime.","features":[{"name":"Describe all the tricks and techniques for effective communication and public speaking"},{"name":"Describe the use and application of videos in a presentation"},{"name":"Recognise the tips to give persuasive talks, briefings, speeches and presentations to individuals and groups"},{"name":"Explain all the required techniques and tricks needed to let your audience do what you want them to do"},{"name":"Describe how to be a great communicator"}],"seat":"54","image":"https://i.ibb.co/Xzdtycj/alison-courseware-intro-4385.jpg","status":"approved"},{"_id":"64835d4e11ef27563c31a95a","instractorname":"Shahidul Islam Faisal","instractoremail":"sifaisalcox@gmail.com","instractorimage": "https://img.freepik.com/free-photo/handsome-corporate-man-real-estate-agent-assistant-smiling-hold-hands-together-how-may-i-help-you-smiling-friendly-polite-assist-customer-white-background_176420-45257.jpg","classname":"How to Become a TV Presenter","price":100,"description":"The first step to becoming a television presenter is to acquire the relevant qualifications and experience. We introduce you to the different fields of Media Studies and describe the kind of internships that can help you get your foot in the door via entry-level jobs in broadcasting. TV presenters also need to understand their responsibilities and the course covers the roles, attributes and daily duties of a presenter. We cover all aspects of on-camera presentation, including speaking techniques, wardrobe and colour selection, nonverbal communication and how to apply makeup to ensure a polished and professional appearance. Interviewing is one of the most common responsibilities of a TV presenter so knowing how to prepare for interviews is vital. The course explains how to prepare for and conduct engaging interviews that captivate your audience. We show you how to choose interview questions, conduct research and prepare scripts for a show.","features":[{"name":"Define the duties and obligations of a TV presenter"},{"name":"List the different types of presenting"},{"name":"Discuss the essential skills and career opportunities of a TV presenter"},{"name":"Explain how the in-ear talkback and teleprompter devices work "}],"seat":"41","image":"https://i.ibb.co/4R1rjsr/alison-courseware-intro-5367.jpg","status":"approved"},{"_id":"64835eda11ef27563c31a95c","instractorname":"suffian","instractoremail":"suffian@gmail.com","instractorimage": "https://img.freepik.com/free-photo/elegant-businessman-office_155003-9641.jpg","classname":"Basics of Journalism","price":112,"description":"Journalism takes many forms, each with its own set of procedures. A journalist does not engage in all forms of journalism. As you advance through this course, we'll explain the procedures of several forms of journalism: access, advocacy, broadcast, citizen, data and more. As a journalist, you should bear in mind the credibility of your information and its source. Explore the different types of information sources that make a credible news production. We highlight the five principles of journalism that will guide you through the ethics of its practices. We also analyze the history and evolution of journalism since the 18th century. Explore events in the past that led to journalism and learn how they led to the foundation of the National Union of Journalists in the United Kingdom.","features":[{"name":"Define ‘journalism’"},{"name":"List the types and forms of journalism"},{"name":"Recall the five principles in the practice of journalism"},{"name":"State the relevant terminologies in journalism and the types of producers in the field"},{"name":"Identify the equipment used for reporting and the three functions of a cue"},{"name":"Summarize the factors that should be considered by producers when constructing a TV news broadcast"}],"seat":"100","image":"https://i.ibb.co/fCBzM76/alison-courseware-intro-4511.jpg","status":"approved"},{"_id":"64835f6f11ef27563c31a95d","instractorname":"suffian","instractoremail":"suffian@gmail.com","instractorimage": "https://img.freepik.com/free-photo/elegant-businessman-office_155003-9641.jpg","classname":"Introduction to Newspaper Journalism","price":100,"description":"Have you ever imagined yourself as the next great feature story writer? Or perhaps you are interested in discovering things and then sharing your findings with others. This short course will introduce the principles of newspaper journalism and equip you with the critical skills you need to excel as a journalist. John's Academy, an online learning company that provides quality education in diverse career fields, presents these lessons","features":[{"name":"Differentiate between ‘diary’ and ‘off-diary’ events"},{"name":"Summarise the history and development of newspaper journalism"},{"name":"List the guidelines for writing a copy presentation"},{"name":"Discuss general guidelines for reporting in hostile environments"}],"seat":"22","image":"https://i.ibb.co/qrcTQYV/alison-courseware-intro-4923.jpg","status":"approved"},{"_id":"64835fe611ef27563c31a95e","instractorname":"suffian","instractoremail":"suffian@gmail.com","instractorimage": "https://img.freepik.com/free-photo/elegant-businessman-office_155003-9641.jpg","classname":"English for Journalism","price":140,"description":"This free online course, English for Journalists, is designed for non-native English speakers who are interested in developing the skills needed for a career in modern journalism. In this free online course, you will explore print and digital media through authentic readings and video lectures, while expanding your vocabulary and increasing your ability to read, research, and develop local and global news stories.","features":[{"name":"Recognize and learn how to research for a news story"},{"name":"Describe effective techniques for a successful interview"},{"name":"Identify and focus on the language needed to write magazine articles"},{"name":"Identify the growth, impact, and challenges of digital news"}],"seat":"39","image":"https://i.ibb.co/25pmzxH/alison-courseware-intro-1916.jpg","status":"approved"},{"_id":"6483609a11ef27563c31a95f","instractorname":"suffian","instractoremail":"suffian@gmail.com","instractorimage": "https://img.freepik.com/free-photo/elegant-businessman-office_155003-9641.jpg","classname":"Video Presentations and Public Speaking","price":143,"description":"Are you interested in learning the necessary skills needed to make a good presentation? This online public speaking course will help you improve your public speaking skills, with a focus on video lectures. Video production can be time-consuming, difficult, technical and expensive, but in this course, you will learn skills and develop public speaking and video conferencing skills that will strengthen your career development. This video production course also covers how to create simple videos for a wide range of business communication needs","features":[{"name":"Describe a comprehensive video production strategy for all aspects of a business"},{"name":"Analyze communications skills more effectively with clients, customers and prospective clients"},{"name":"Explain and create simple ‘talking head’ videos for all aspects of business"},{"name":"Indicate how to develop a vibrant online presence"}],"seat":"28","image":"https://i.ibb.co/Xzdtycj/alison-courseware-intro-4385.jpg","status":"approved"},{"_id":"648361be11ef27563c31a961","instractorname":"abdullah","instractoremail":"abdullah@gmail.com","instractorimage": "https://img.freepik.com/free-photo/young-bearded-man-with-striped-shirt_273609-5677.jpg","classname":"Understanding Digital Journalism","price":133,"description":"Today’s journalists make extensive use of the internet to both research and publish their stories. This journalism training course covers the methods, procedures, guidelines relevant to the professional. We then provide professional advice and examine the regulations and ethics governing digital journalism. We describe the impact of the internet on the news industry and describe the skills, tools and applications that today's reporters need.","features":[{"name":"Discuss various internet concepts like FTP, blogging, news photography and graphics"},{"name":"Identify the mobile navigation, voice command and storyboard "},{"name":"Discuss how web design and search engines affect online research"},{"name":"Explain the process of multimedia news collection"}],"seat":"23","image":"https://i.ibb.co/whWMsGn/alison-courseware-intro-5400.jpg","status":"approved"},{"_id":"6483625911ef27563c31a962","instractorname":"abdullah","instractoremail":"abdullah@gmail.com","instractorimage": "https://img.freepik.com/free-photo/young-bearded-man-with-striped-shirt_273609-5677.jpg","classname":"Journalism and Print Media","price":159,"description":"In this course you will study the history of the newspaper, from the 16th to the 20th centuries. You will see how the printing press revolutionized mass media, enabling the dissemination of political, economic and current affairs information to people of all classes. You will learn how publishers such as Joseph Pulitzer and William Randolph Hearst successfully 'dumbed down' news, using sensationalism and tabloid formats","features":[{"name":"Outline the evolution and development of print media"},{"name":"Explain the different print journalism styles"},{"name":"Discuss the different types of magazines and their audiences"},{"name":"Discuss the factors associated with the decline in print news readership"}],"seat":"25","image":"https://i.ibb.co/rycPWjP/alison-courseware-intro-1648.jpg","status":"approved"},{"_id":"648362d811ef27563c31a963","instractorname":"abdullah","instractoremail":"abdullah@gmail.com","instractorimage": "https://img.freepik.com/free-photo/young-bearded-man-with-striped-shirt_273609-5677.jpg","classname":"English Grammar and Vocabulary - The Media (Advanced Level)","price":174,"description":"This course will first introduce you to English vocabulary related to watching media, such as 'to stream' which means to watch a movie online, and 'binge-watch' which means to watch many episodes of a tv programme at once. You will then look at English for news and learn about 'headlines' which means the most important news stories on a particular day and 'editorial' which is an opinion piece written by a newspaper editor.","features":[{"name":"Justify when it is necessary to use the preposition 'by' in passive sentences"},{"name":"Review the use of passive reporting structures and how they differ to active sentences"},{"name":"State the instances in which the passive form is generally used"},{"name":"Summarise the language used for reviewing television series"}],"seat":"35","image":"https://i.ibb.co/sKmDyZx/alison-courseware-intro-1320.jpg","status":"approved"},{"_id":"6483643e11ef27563c31a965","instractorname":"mukkarama","instractoremail":"mukarama@gmail.com","instractorimage": "https://img.freepik.com/free-photo/businessman-black-suit-promoting-something_114579-18995.jpg","classname":"Public Speaking on Panels","price":145,"description":"Whether you run a business or work as an employee, public speaking skills play a key role in deciding your future and growth in your career. This free online public speaking course will teach you how to write your goals for a speech, practice your speech on video and test the effectiveness of your speech through feedback from friends or colleagues. You will also be taught how to instantly grab the audience’s attention instantly. A panel presentation is a type of public speaking in which informal discussions take place among diverse members of a group. Some of what you will be taken through includes the possible outcomes of a panel discussion, how to present your ideas effectively in a panel presentation and Microsoft PowerPoint techniques so you can make your presentation interesting and captivating through interesting visuals. ","features":[{"name":"List the possible outcomes of a panel presentation"},{"name":"Discuss the proper use of PowerPoint for a presentation"},{"name":"Recognize the common blunders committed by engineers in public speaking"},{"name":"List the common differences between men and women in the field of public speaking"}],"seat":"21","image":"https://i.ibb.co/86VhVbk/alison-courseware-intro-3973.jpg","status":"approved"},{"_id":"648364b611ef27563c31a966","instractorname":"mukkarama","instractoremail":"mukarama@gmail.com","instractorimage": "https://img.freepik.com/free-photo/businessman-black-suit-promoting-something_114579-18995.jpg","classname":"Presentation and Speaking Skills for Webinars","price":286,"description":"This course, Presentation and Speaking Skills for Webinars, will provide you with an understanding of Presentation Skills. You will learn about creating the program, choosing your delivery methods, verbal communication skills, and non--verbal communication skills. You will be able to explain how to overcome nervousness associated with your presentation. You will also learn about creating fantastic flip charts, compelling PowerPoint presentations, how to wow 'em with the white board, and how to pump it up a notch.","features":[{"name":"Outline Overcoming the nervousness of public speakin"},{"name":"Explain taking and answering questions after your presentation"},{"name":"Indicate what a webinar can do to benefit a presentation"},{"name":"Describe what to do leading up to your webinar"}],"seat":"27","image":"https://i.ibb.co/HqQcnpx/alison-courseware-intro-2336.jpg","status":"approved"},{"_id":"6483652611ef27563c31a967","instractorname":"mukkarama","instractoremail":"mukarama@gmail.com","instractorimage": "https://img.freepik.com/free-photo/businessman-black-suit-promoting-something_114579-18995.jpg","classname":"Public Speaking Emergencies","price":187,"description":"Do you know that the highest number of customers come in to buy your product or services through sales presentations? A sales presentation is a selling technique where you persuade your potential customers to take an action you would like them to take. You will learn how to give presentations to your prospects with confidence and explain the value of your product and services in an interesting way. There are some common blunders that are committed by most people during their speeches. You will be taught how to avoid these and stand out from your competitors. Having notes during your speech is helpful to make your speech go smoothly and touch all the necessary points. However, there is a possibility that you end up reading from the notes and appear nervous and robotic to the audience. You will learn how to narrow down your message points to five so that the audience can easily understand and remember your message. Some practical tips on how to create a one-page cheat sheet and use it in their speech without looking like they are reading from it are included in this section","features":[{"name":"Describe the importance of sales presentations"},{"name":"Outline advantages and disadvantages of a one-on-one presentation"},{"name":"Explain the benefits and the proper use of a cheat sheet during a presentation"},{"name":"Identify the common mistakes in a PowerPoint presentation"}],"seat":"25","image":"https://i.ibb.co/25pmzxH/alison-courseware-intro-1916.jpg","status":"approved"},{"_id":"6483660811ef27563c31a969","instractorname":"forhad","instractoremail":"forhad@gmail.com","instractorimage": "https://img.freepik.com/free-photo/front-view-man-working-laptop_23-2149915910.jpg","classname":"Diary and Invitation Writing","price":167,"description":"This course will discuss the benefits of writing diaries and invitations. We will use examples to explore different journal and invitation formats and discover some essential tips and guidelines for writing these. You will compare the differences between formal and informal invitations. In addition, we will discuss why it is crucial to respond to formal or informal invitations. Learn what you need to know and enrol today","features":[{"name":"Explain what diary writing means and the advantages of using paper"},{"name":"Outline how to overcome the grammar and spelling problems of writing a diary"},{"name":"Describe what an ‘invitation’ is and what it is used for"}],"seat":"26","image":"https://i.ibb.co/56fQjyn/alison-courseware-intro-5051.jpg","status":"approved"},{"_id":"6483668211ef27563c31a96a","instractorname":"forhad","instractoremail":"forhad@gmail.com","instractorimage": "https://img.freepik.com/free-photo/front-view-man-working-laptop_23-2149915910.jpg","classname":"The Body Language of Public Speaking","price":252,"description":"Body language is a collection of nonverbal cues that you employ to communicate your emotions and intentions. There are three big myths that we need to address when it comes to body language in the workplace and body language in general. This course will explore those myths and expose the truth about those myths based on discoveries done by TJ Walker. Public speaking is any form of a presentation given live by a speaker or a presenter to an audience or any group of people. Speaking publicly in front of a large group of people causes anxiety and nervousness. As such, we tend to avoid it. But at some point in life, you might find yourself in a situation where you have no other choice. And we know you will want to make a good presentation and connect well with the audience. This course will teach you how to avoid possible blunders and techniques to calm your nerves and appear comfortable and relaxed during your presentation. ","features":[{"name":"Outline bad body language signals when it comes to speaking in public"},{"name":"Recall how to react to mistakes made during public speaking"},{"name":"List the type of eye contact in communication during public speaking"},{"name":"Explain how to do a good PowerPoint presentation in a workplace"}],"seat":"12","image":"https://i.ibb.co/25pmzxH/alison-courseware-intro-1916.jpg","status":"approved"},{"_id":"6483679d11ef27563c31a96c","instractorname":"afroja","instractoremail":"afroja@gmail.com","instractorimage": "https://img.freepik.com/free-photo/smiling-confident-businesswoman-posing-with-arms-folded_1262-20950.jpg ","classname":"Diploma in Effective Writing Skills","price":233,"description":"This course will expose you to different forms of writing with emphasis on making the writing effective. It begins with outlining the fundamentals of effective writing by enlightening you about the principles of effective writing, types of effective writing and notions of correctness and appropriateness to be followed in writing.\n\nNext, you will learn about the various functions and mechanics of business writing and the types and formats of business letters. This course also provides insights about the various aspects, processes strategies and styles involved in report writing. Effective writing demonstrates that the writer values the reader's time. When a writer is able to organize his/her thoughts and concerns and present them in a way that is easily read and understood, the reader benefits.","features":[{"name":"Describe the principles of effective writing"},{"name":"Explain the various types and stages of effective writing"},{"name":"Specify the requirements for writing an essay"},{"name":"Explain the various types of essay writing and their requirements"},{"name":"Examine the various aspects and processes involved in report writing"}],"seat":"48","image":"https://i.ibb.co/HVB69qF/alison-courseware-intro-2047.jpg","status":"approved"},{"_id":"6483680c11ef27563c31a96d","instractorname":"afroja","instractoremail":"afroja@gmail.com","instractorimage": "https://img.freepik.com/free-photo/smiling-confident-businesswoman-posing-with-arms-folded_1262-20950.jpg ","classname":"Planning for Ultimate Public Speaking Success","price":123,"description":"When given an opportunity to speak in public, our responses can be as varied as our faces for so many reasons that could include our temperaments, backgrounds and exposure. While some people seem to thrive addressing any number of audiences, others run as far away as possible from speaking to anyone who is not a close friend or family member. This course is tailored to help anyone, regardless of their age, learn the fundamentals of planning, preparing and delivering a speech to the public. After a guided tour of the content of the course to ensure you derive maximum benefit, you will be taught how to set your exact public speaking goals so that measurable progress can be made. In public speaking, self-confidence is extremely important and the way you conduct yourself portrays your confidence. Even though fear is a natural emotion, overcoming stage fright and anxiousness is necessary. The idea is to appear confident even if you aren't and this course will show you tactics you can employ to eliminate fear and appear confident to your audience.","features":[{"name":"Explain why it is important to stop acting scared when giving a speech"},{"name":"Recognize the need for eye contact when speaking to an audience"},{"name":"Explain why stories are important and how every successful speaker uses them effectively"},{"name":"Recall how and when it is necessary to use PowerPoint during speeches"}],"seat":"21","image":"https://i.ibb.co/Xzdtycj/alison-courseware-intro-4385.jpg","status":"approved"},{"_id":"6483692311ef27563c31a96f","instractorname":"karim jabbar","instractoremail":"karim@jabbar.com","instractorimage": "https://img.freepik.com/free-photo/handsome-young-businessman-suit_273609-6513.jpg ","classname":"Conquering Your Fear of Public Speaking","price":121,"description":"Do you find the idea of speaking to a large audience scary? The good news is that you are not alone and you can easily overcome your fear of public speaking with practice. This public speaking course will teach you the phased process of identifying and eliminating your fears about public speaking where you will learn how to practice for a presentation in order to remove your flaws and make your message concise and interesting to your audience.","features":[{"name":"Identify elements that make your speech interesting and memorable to the audience"},{"name":"Describe how recording yourself will help you enhance your communication skills"},{"name":"Distinguish between good communicators and bad communicators"},{"name":"List common fake solutions that do not reduce speech anxiety"}],"seat":"22","image":"https://i.ibb.co/z61tPRX/alison-courseware-intro-5400.jpg","status":"approved"},{"_id":"6483699311ef27563c31a970","instractorname":"karim jabbar","instractoremail":"karim@jabbar.com","instractorimage": "https://img.freepik.com/free-photo/handsome-young-businessman-suit_273609-6513.jpg ","classname":"Principles of Creative Writing","price":244,"description":"Writers strive to use the perfect word as the right vocabulary and adherence to a specific writing style can make a piece of writing more engaging. This course teaches you the fundamentals of creative writing. We go over many grammatical rules and explain how to use the appropriate writing terminology correctly. We lay out the elements of creative writing to help you learn how to harness the ancient ‘rules’ of writing to turn out a bestseller.","features":[{"name":"Discuss the purpose and power of creative writing"},{"name":"Outline important grammatical rules that affect writing"},{"name":"List the core elements of effective storytelling"},{"name":"Identify the two writing genres"}],"seat":"42","image":"https://i.ibb.co/282FZZG/alison-courseware-intro-5783.jpg","status":"approved"},{"_id":"64839e53ce41058fe0362c31","instractorname":"Shahidul Islam Faisal","instractoremail":"sifaisalcox@gmail.com","instractorimage": "https://img.freepik.com/free-photo/handsome-corporate-man-real-estate-agent-assistant-smiling-hold-hands-together-how-may-i-help-you-smiling-friendly-polite-assist-customer-white-background_176420-45257.jpg","classname":"ddxzx","price":35,"description":"bxx","features":[{"name":"fgd"}],"seat":"54","image":"https://i.ibb.co/C5BmtpR/alison-courseware-intro-2047.jpg","status":"pending"}]